In [1]:
import pandas as pd
import os

In [2]:
full_donor_data = os.path.join('Resources/donors2008.csv')
donors_df = pd.read_csv(full_donor_data)

In [8]:
donors_df.head(10)

,LastName,FirstName,Employer,City,State,Zip,Amount,FIELD8
0,Aaron,Eugene,State Department,Dulles,VA,20189,500.0,NaN
1,Abadi,Barbara,Abadi & Co.,New York,NY,10021,200.0,NaN
2,Adamany,Anthony,Retired,Rockford,IL,61103,500.0,NaN
3,Adams,Lorraine,Self,New York,NY,10026,200.0,NaN
4,Adams,Marion,None,Exeter,NH,03833,100.0,NaN
5,Adams,Michelle,Gordon Training,Carlsbad,CA,92009,100.0,NaN
6,Adamson,Nelson,Marquette General Hosp,Iron Mountain,MI,49801,500.0,NaN
7,Adelman,Clifford,Self,Kensington,MD,20895,250.0,NaN
8,Adida,Ben,Harvard University,Mountain View,CA,94043,200.0,NaN
9,Adler,Michael M.,"Adler Group, Inc.",Miami Beach,FL,33172,5000.0,NaN

In [12]:
avg_amount_by_state = donors_df.groupby(['State']).mean()['Amount']
avg_amount_by_state

State
AE     100.000000
AK     175.000000
AL     212.500000
AP     200.000000
AR     350.000000
AZ     206.000000
CA     685.234973
CO     851.250000
CT     825.714286
DC     647.115385
DE     190.000000
FL     709.358974
GA     842.307692
HI     195.454545
IA     600.000000
ID     341.666667
IL    1114.519231
IN     225.000000
KS     283.333333
KY     735.000000
LA     158.333333
MA     750.714286
MD     819.823529
ME     211.111111
MI     241.666667
MN     697.000000
MO     463.888889
MS    1208.333333
MT     200.000000
NC     440.625000
NE     183.333333
NH     368.750000
NJ     276.111111
NM     298.913043
NV     393.333333
NY     910.829146
OH     501.562500
OK     200.000000
OR     321.052632
PA     896.755556
QC     250.000000
RI     700.000000
SC     287.500000
TN     257.142857
TX     485.193182
UT     200.000000
VA     701.093465
VI     225.000000
VT     350.000000
WA     399.537037
WI     185.416667
WV     183.333333
WY     125.000000
Name: Amount, dtype: float64

In [13]:
test_grades = {
    'Class': ['Oct', 'Oct', 'Jan', 'Jan', 'Oct', 'Jan'], 
    'Name': ["Cyndy", "Logan", "Laci", "Elmer", "Crystle", "Emmie"], 
    'Test Score': [90, 59, 72, 88, 98, 60]}

In [ ]:
df_letter_grades = pd.['Test Score']()